<!DOCTYPE html>
<html lang="en">
  <head prefix="foaf: http://xmlns.com/foaf/0.1/">
    <title>Bridges between GraphQL and RDF</title>

    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <link rel="stylesheet" href="shower/themes/material/styles/styles.css">
    <link rel="stylesheet" href="styles/rt-custom.css" />
    <link href='https://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css' />
    <link href='https://fonts.googleapis.com/css?family=Droid+Sans' rel='stylesheet' type='text/css' />
    
    <link rel="foaf:maker" href="https://www.rubensworks.net/#me" />

    <style>
      .shower {
        --slide-ratio: calc(16 / 9);
      }
    </style>
  </head>

  <body class="shower list" prefix="rdf: http://www.w3.org/1999/02/22-rdf-syntax-ns# foaf: http://xmlns.com/foaf/0.1/ owl: http://www.w3.org/2002/07/owl# xsd: http://www.w3.org/2001/XMLSchema# org: http://www.w3.org/ns/org# schema: http://schema.org/ cite: http://purl.org/spar/cito/" typeof="schema:PresentationDigitalDocument">
    <header class="caption">
      <div class="title">
        <h1 property="schema:name">Bridges between GraphQL and RDF</h1>
      </div>
      <div class="captiondata">
        <p class="author" rel="schema:author"><a href="https://www.rubensworks.net/#me">Ruben Taelman</a></p>
        <p class="venue">
          W3C Workshop on Web Standardization for Graph Data 2019 — <a href="https://en.wikipedia.org/wiki/Berlin">Berlin</a>, <span rel="schema:datePublished">March 5 2019</span></a>
        </p>
      </div>
    </header>

    <section id="title" class="slide title">
      <h2>Bridges between<br />GraphQL and RDF</h2>
      <ul class="author inline">
          <li class="current"><a href="https://www.rubensworks.net/">Ruben Taelman</a> — <a href="https://twitter.com/rubensworks">@rubensworks</a></li>
      </ul>
      <p class="affiliation"><a href="http://idlab.technology/">Ghent University — imec — IDLab, Belgium</a></p>
    </section>
    
    <section id="intro-graphql" class="slide">
      <h2>Finding a <em>human</em> by <em>id</em> with GraphQL</h2>
      <p>
          <h4 style="margin: 0">GraphQL Query:</h4>
          <pre style="background-color: white; margin: 0">
{
  human(id: "1000") {
    name
    height
  }
}
          </pre>
          <h4 style="margin: 0">JSON results:</h4>
          <pre style="background-color: white; margin: 0">
{
  "data": {
    "human": {
      "name": "Luke Skywalker",
      "height": 1.72
    }
  }
}
          </pre>
      </p>
    </section>
    
    <section id="intro-sparql" class="slide">
      <h2>Finding a <em>human</em> by <em>URI</em> with SPARQL</h2>
      <p>
          <h4 style="margin: 0">GraphQL Query:</h4>
          <pre style="background-color: white; margin: 0">
@prefix schema: &lt;https://schema.org/&gt;.
SELECT ?name ?height WHERE {
  &lt;http//example.org/human/1000&gt; a schema:Person;
                                   schema:name ?name;
                                   schema:height ?height.
}
          </pre>
          <h4 style="margin: 0">JSON results:</h4>
          <pre style="background-color: white; margin: 0; font-size: small;">
{
  "head": {
    "vars": [ "name" , "height" ]
  },
  "results": {
    "bindings": [
      {
        "name": { "type": "literal" , "value": "Luke Skywalker" },
        "height": { "type": "literal" , "value": "1.72", "datatype": "http://www.w3.org/2001/XMLSchema#double" },
      }
    ]
  }
}
          </pre>
      </p>
    </section>
    
    <section id="graphql-vs-graphql" class="slide">
      <h2>GraphQL vs SPARQL</h2>
      <table>
          <tr>
              <th></th>
              <th>GraphQL</th>
              <th>SPARQL</th>
          </tr>
          <tr>
              <td><strong>Low developer effort</strong></td>
              <td>✓</td>
              <td></td>
          </tr>
          <tr>
              <td><strong>Wide availability of professional development tools</strong></td>
              <td>✓</td>
              <td></td>
          </tr>
          <tr>
              <td><strong>High expressivity</strong></td>
              <td></td>
              <td>✓</td>
          </tr>
          <tr>
              <td><strong>Reusability of queries across datasets</strong></td>
              <td></td>
              <td>✓</td>
          </tr>
      </table>
    </section>
    
    <section id="graphq-to-rdf-approaches" class="slide">
      <h2>Using GraphQL to query RDF:<br />different approaches exist</h2>
      <ul>
          <li>
              <a href="https://comunica.github.io/Article-ISWC2018-Demo-GraphQlLD/"><strong>GraphQL-LD</strong></a>: Conversion to SPARQL based on a <strong>JSON-LD context</strong>,<br />independent of any engine and works for <strong>any RDF source</strong>.
          </li>
          <li>
              <a href="https://www.stardog.com/"><strong>Stardog</strong></a>: SPARQL engine that also accepts GraphQL (converted to SPARQL). Conversion is done using a <strong>GraphQL schema</strong>, or <code>@prefix</code> <strong>directives</strong>.
          </li>
          <li>
              <a href="http://hypergraphql.org/"><strong>HyperGraphQL</strong></a>: GraphQL interface wrapper around RDF sources using a <strong>configuration file</strong> and an <strong>annotated GraphQL schema</strong>.
          </li>
          <li>
              <a href="https://www.topquadrant.com/products/topbraid-enterprise-data-governance/"><strong>TopBraid</strong></a>: Graph store with GraphQL interface. GraphQL schemas can be generated using shape definitions (SHACL).
          </li>
      </ul>
    </section>
    
    <section id="incompatible" class="slide">
      <h2>These approaches are incompatible</h2>
      <div style="width: 30%; float: left">
          <h4 style="margin: 0">GraphQL-LD:</h4>
          <pre style="background-color: white; margin: 0">
{
  human {
    name
    height
  }
}
          </pre>
          <h4 style="margin: 0">Stardog:</h4>
          <pre style="background-color: white; margin: 0">
{
  Human {
    name
    height
  }
}
          </pre>
      </div>
      <div style="width: 65%; float: right">
          <h4 style="margin: 0">&nbsp;</h4>
          <pre style="background-color: white; margin: 0">
SELECT ?name ?height WHERE {
  _:b1 ex:human _:human.
  _:human ex:name ?name;
          ex:height ?height.
}
          </pre>
          <br />
          <h4 style="margin: 0">&nbsp;</h4>
          <pre style="background-color: white; margin: 0">
SELECT ?name ?height WHERE {
  _:b1 a ex:Human;
       ex:name ?name;
       ex:height ?height.
}
          </pre>
      </div>
    </section>
    
    <section id="incompatible-more" class="slide">
      <h2>More differences</h2>
      <ul>
          <li>Aggregates <em>(sum, count, ...)</em></li>
          <li>Filtering <em>(directives, custom fields, ...)</em></li>
          <li>Optional fields</li>
          <li>Named graphs</li>
          <li>Ordering</li>
          <li>Pagination</li>
          <li>...</li>
      </ul>
    </section>
    
    <section id="conclusion" class="slide">
      <h2>A standard way of querying<br />RDF with GraphQL is needed</h2>
      <p><h4>Proposal for a plan of action:</h4></p>
      <ol>
          <li>
              <strong>Analyze</strong> the different aspects of querying RDF with GraphQL. <br />
              <em>(Property paths, joins, ordering, aggregation, ...)</em>
          </li>
          <li>
              <strong>Categorize</strong> the existing approaches over these aspects.
          </li>
          <li>
              <strong>Compare</strong> the advantages and disadvantages of each aspect approach.
          </li>
          <li>
              <strong>Propose a standard</strong> approach and semantics for querying RDF with GraphQL.
          </li>
      </ol>
    </section>

    <footer>
      <p class="license">
            &#169; <span property="schema:copyrightYear">2019</span> <a href="https://www.rubensworks.net" rel="schema:copyrightHolder"><span resource="https://www.rubensworks.net/#me">Ruben Taelman</span></a>
            — <a rel="license" href="https://creativecommons.org/licenses/by/4.0/" property="schema:license">Creative Commons Attribution 4.0</a>, unless otherwise indicated.
      </p>
      <a href="https://github.com/rubensworks/slides-2019-w3c-data-ws-graphql-rdf">Source</a>
    </footer>

    <script src="shower/shower.min.js"></script>
  </body>
</html>
